setInterval(setClock, 1000)

const hourHand = document.querySelector('[data-hour-hand]')
const minuteHand = document.querySelector('[data-minute-hand]')
const secondHand = document.querySelector('[data-second-hand]')

function setClock() {
    const currentDate = new Date()
    const secondsRatio = currentDate.getSeconds() / 60
    const minutesRatio = (secondsRatio + currentDate.getMinutes()) / 60
    const hoursRatio = (minutesRatio + currentDate.getHours()) / 12
    setRotation(secondHand, secondsRatio)
    setRotation(minuteHand, minutesRatio)
    setRotation(hourHand, hoursRatio)
}

function setRotation(element, rotationRatio) {
    element.style.setProperty('--rotation', rotationRatio * 360)
}


setClock()

















































setInterval(() => {
  console.log('ГОСПОДЕ ИСУСЕ ХРИСТЕ СИНЕ БОЖИЈИ ПОМИЛУЈ МЕ ГРЕШНОГА.  БОГОРОДИЦЕ ДЈЕВО РАДУЈ СЕ БЛАГОДАТНА МАРИЈО, БЛАГОСЛОВЕНА СИ ТИ МЕЂУ ЖЕНАМА И БАЛГОСЛОВЕН ЈЕ ПЛОД УТРОБЕ ТВОЈЕ. СЛАВА ГОСПОДУ!',)
  console.log('ГОСПОДЕ ИСУСЕ ХРИСТЕ СИНЕ БОЖИЈИ ПОМИЛУЈ МЕ ГРЕШНОГА. БОГОРОДИЦЕ ДЈЕВО РАДУЈ СЕ БЛАГОДАТНА МАРИЈО, БЛАГОСЛОВЕНА СИ ТИ МЕЂУ ЖЕНАМА И БАЛГОСЛОВЕН ЈЕ ПЛОД УТРОБЕ ТВОЈЕ. СЛАВА ГОСПОДУ!',)
}, 9000)  


  setInterval(() => {
    console.log('БЛАЖЕН човек који не иде на веће безбожника,и на пут грешника не стаде,и на седалиште погубника не седе.Него је у закону Господњем воља његова,и у закону Његовом поучава се дан и ноћ.И биће као дрво засађено крај извора вода,које плод свој доноси у време своје,и лист његов неће отпасти,и све што ради преуспеће.Нису такви безбожници, нису такви,него су као прах који ветар размеће са лица земље.Зато неће устати безбожници на суду,нити грешници у сабору праведних.Јер зна Господ пут праведних,и пут безбожника пропашће.')
  }, 11779)

  setInterval(() => {
    console.log('Псалам 26.(Псалам) Давидов, пре помазања.(МТ: Псалам 27) ГОСПОД је просветљење моје и Спаситељ мој, кога ћу се бојати?Господ је заштитник живота мога,кога ћу се плашити? Када се приближују на ме злостављачи да поједу тело моје,тлачитељи и непријатељи моји, они ослабише и падоше.Ако се построји на ме табор (непријатеља), неће се уплашити срце моје; ако се подигне рат на ме, ја ћу се и тада надати. Једно молих од Господа, и то тражах: да живим у дому Господњем све дане живота мога, да гледам красоту Господњу и посећујем храм свети Његов. Јер ме сакри у насељу Своме у дан зала мојих,покри ме у скровишту шатора Свога,на стену уздиже ме.И сада, ево, уздиже главу моју на непријатеље моје.Обиђох и принесох у шатору Његовом жртву (хвале и) клицања;певаћу и псалмопојаћу Господу.Услиши, Господе, глас мој којим завиках;помилуј ме и услиши ме.Теби рече срце моје: (Господа ћу тражити).Тражаше Те лице моје;лице Твоје, Господе, тражићу.Не окрени лице Твоје од мене,и не уклони се у гњеву Своме од слуге Твога.Буди ми помоћник, не одбаци ме и не напусти ме, Боже Спаситељу мој.Јер отац мој и мати моја оставише ме,а Господ прихвати ме.Законоположи ме, Господе, путем Твојим,и упути ме по стази правој, ради непријатеља мојих.Не предај ме душама оних који ме муче,јер усташе на ме сведоци неправедни,и слага неправда (саму) себе.Верујем да ћу видети добра Господња у земљи живих.Потрпи (=стрпљиво чекај) Господа,јуначи се и снажи се, срце моје,и потрпи Господа.')
  }, 12779)

  setInterval(() => {
     console.log('ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ!ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ! ГОСПОДЕ ПОМИЛУЈ!')
  }, 1500)

  setInterval(() => {
    console.log('Псалам 90. Похвална песма Давидова. (МТ: Псалам 91) КОЈИ живи у помоћи Вишњега,под кровом Бога Небескога настаниће се.Рећи ће Господу: Заступник мој јеси Ти, и уточиште моје,Бог мој, и уздаћу се у Њега.Јер ће те Он избавити од замке ловачке,и од речи метежне.Плећима Својим заклониће те,и под крилима Његовим надаћеш се;као оружјем окружиће те истина Његова.Нећеш се бојати страха ноћнога,од стреле која лети по дану,од ствари која проходи у тами,од сусрета и демона подневнога.Пашће поред тебе хиљада,и десет хиљада с десне стране теби,а тебе се неће дотаћи;ипак ћеш очима својим сагледати,и расплату грешника видећеш.Јер си Ти, Господе, надање моје;Вишњега си поставио за уточиште своје.Неће те зло дотаћи,и ударац се неће приближити стану твоме.Јер ће Анђелима Својим заповедити за тебе,[1]да те сачувају на свим путевима твојим.На руке ће те узети,да се не спотакне нога твоја о камен.На аспиду и змију отровну наступаћеш,и згазићеш лава и змаја.Јер се на Мене поуздао, и избавићу га;покрићу га, јер је познао Име Моје.Призваће Ме, и услишаћу га;са њиме ћу бити у невољи,избавићу га, и прославићу га.Дугим данима (живота) испунићу га,и показаћу му спасење Моје.')
  }, 5000)
